[
  {
    "StartingBidUSD": 100,
    "EndingBidUSD": 600,
    "Alt": "Web Applications Service Offer",
    "Questions": [
      {
        "LocalizedQuestion": {
          "eng": "If you’re ordering for a business, what’s your industry?",
          "esp": "Si estas haciendo la orden para un negocio, ¿cual es tu industria?"
        },
        "LocalizedExample": null
      },
      {
        "LocalizedQuestion": {
          "eng": "Is this order part of a bigger project you\u0027re working on?",
          "esp": "¿Esta orden es parte de un proyecto mayor en el cual estás trabajando?"
        },
        "LocalizedExample": null
      }
    ],
    "Enabled": true,
    "LocalizedNames": {
      "esp": "Aplicaciones Web",
      "eng": "Web Applications"
    },
    "LocalizedDescriptions": {
      "esp": "Desarrollaré tu aplicación web bajo tus necesidades, incluyendo responsividad completa, tanto en el \u0027back\u0027 como en el \u0027front\u0027; incluyendo una API web para tu sitio, y código ejecutandose desde el cliente para bajar la carga del servidor. Botones, formas, etc.\nTambién puedo incluír soluciones de IA para tus necesidades!",
      "eng": "I will develop your website as per your needs, including full responsiveness, both back-end and front-end development, including a custom Web API for your site, as well as client-side code execution for server off-loading, buttons, forms, etc.\nI also can include AI solutions for your needs!"
    },
    "AttachedMedia": null
  },
  {
    "StartingBidUSD": 40,
    "EndingBidUSD": 150,
    "Questions": [
      {
        "LocalizedQuestion": {
          "eng": "If you’re ordering for a business, what’s your industry?",
          "esp": "Si estas haciendo la orden para un negocio, ¿cual es tu industria?"
        },
        "LocalizedExample": null
      },
      {
        "LocalizedQuestion": {
          "eng": "Is this order part of a bigger project you\u0027re working on?",
          "esp": "¿Esta orden es parte de un proyecto mayor en el cual estás trabajando?"
        },
        "LocalizedExample": null
      }
    ],
    "Enabled": true,
    "Alt": "Chat Bots Service Offer",
    "LocalizedNames": {
      "esp": "Bots de Chat",
      "eng": "Chat Bots"
    },
    "LocalizedDescriptions": {
      "esp": "Desarrollaré tu chat-bot bajo tus necesidades, incluyendo tantos pasos como necesites según la complejidad de tu pedido. El bot puede ser multi-plataforma, y de ser necesario, puede incluir soluciones de IA. El bot puede interactuar con tantos servicios como sean necesarios para tus fines.",
      "eng": "I will develop your chatbot as per your needs, including as many steps as you need following the complexity of your order. The bot can be multi-platform, and, if it\u0027s necessary, can include AI solutions. The bot can interact with as many services as necessary for your ends."
    },
    "AttachedMedia": null
  },
  {
    "StartingBidUSD": 20,
    "EndingBidUSD": 50,
    "Questions": [
      {
        "LocalizedQuestion": {
          "eng": "What\u0027s your current level of understanding of programming and computing, in general?",
          "esp": "¿Cuál es tu nivel de entendimiento actual sobre la programación, y la computación en general?"
        },
        "LocalizedExample": null
      },
      {
        "LocalizedQuestion": {
          "eng": "What\u0027s your current level of expertise in the programming language of your order?",
          "esp": "¿Cuál es tu nivel de proficiencia actual en el lenguaje de programación que solicitaste?"
        },
        "LocalizedExample": null
      }
    ],
    "Enabled": true,
    "Alt": "Code Tutoring Service Offer",
    "LocalizedNames": {
      "esp": "Lecciones de Programación",
      "eng": "Code Tutorship"
    },
    "LocalizedDescriptions": {
      "esp": "Te acompañaré en tu aventura hacia el mundo de la programación! Te enseñaré los conceptos básicos, intermedios y avanzados para que puedas velozmente convertirte en un gran programador.\nLa computación es un arte extenso y mágnifico, y si bien puedes aprender por tu cuenta, necesitas conocer muchas cosas para ser efectivo. Puedo ayudarte a empezar, y guiarte en tu camino para que mejores con velocidad.",
      "eng": "I\u0027ll travel alongside you in your adventure through the world of programming! I\u0027ll teach you the basics, the not-so-basics and the advanced concepts so you may quickly become a great developer.\nComputing is a magnificent and extense art, and though you can learn by yourself, you need to know a great many things to be effective. I can help you get started, and guide you in your way so that you can improve quickly."
    },
    "AttachedMedia": null
  },
  {
    "StartingBidUSD": 60,
    "EndingBidUSD": 200,
    "Questions": [
      {
        "LocalizedQuestion": {
          "eng": "If you’re ordering for a business, what’s your industry?",
          "esp": "Si estas haciendo la orden para un negocio, ¿cual es tu industria?"
        },
        "LocalizedExample": null
      },
      {
        "LocalizedQuestion": {
          "eng": "Is this order part of a bigger project you\u0027re working on?",
          "esp": "¿Esta orden es parte de un proyecto mayor en el cual estás trabajando?"
        },
        "LocalizedExample": null
      }
    ],
    "Alt": "Microcontroller Service Offer",
    "Enabled": true,
    "LocalizedNames": {
      "esp": "Arduino, ESP32 y Raspberry Pis",
      "eng": "Arduino, ESP32, and Raspberry Pis\u0027"
    },
    "LocalizedDescriptions": {
      "esp": "Desarrollaré el firmware/software de tu controlador bajo tus necesidades, incluyendo sensores, actuadores, servicios y comunicación según permita el dispositivo.",
      "eng": "I will develop the firmware/software of your controller as per your needs, including sensors, services and communications as permitted by the device."
    },
    "AttachedMedia": null
  }
]
