[
  {
    "Enabled": true,
    "Secondary": false,
	"LocalizedTag": {
		"eng": "Thesis Project",
		"esp": "Proyecto de grado"
	},
    "Alt": "Critical Conditions Controller for an Aquaponics System",
    "LocalizedNames": {
      "eng": "Critical Conditions Controller for an Aquaponics System",
      "esp": "Controlador de Condiciones Críticas para un Sistema Acuapónico"
    },
    "LocalizedDescriptions": {
      "eng": "A feature complete system designed from the ground up to manage, control and observe a full Aquaponics loop, including live fish observation, sensor-based comprehensive data reading and remote control and observation.\nFeaturing several microcontrollers from Arduino, to ESP32 and Raspberry Pis, a device -\u003E local server -\u003E global server architecture, and a beautiful UI front-end for displaying charts, information summaries, notifications and alerts; and manage permissions and granular user acceses.",
      "esp": "Un sistema repleto de features diseñado desde 0 para manejar, contorlar y observar un búcle acuapónico completo, incluyendo observación en vivo de los peces, lectura de parámetros comprensivos basado en sensores y control y observación remota.\nJunto con varios microcontroladores incluyendo Arduinos, ESP32 y Raspberry Pis, y una arquitectura modelada a partir de dispositivo -\u003E servidor local -\u003E servidor global, y una interfaz gráfica hermosa para mostrar gráficos de datos, sumarios informativos, notificaciones y alertas; y manejar permisos y acceso granular de usuario."
    },
    "AttachedMedia": null
  },
  {
    "Enabled": true,
    "Secondary": false,
	"LocalizedTag": {
		"eng": "Personal Project",
		"esp": "Proyecto Personal"
	},
    "Alt": "MagicEngine",
    "LocalizedNames": {
      "eng": "Video Game Engine with highly customizable graphics system",
      "esp": "Motor de Video Juegos con sistema gráfico personalizable"
    },
    "LocalizedDescriptions": {
      "eng": "An experimental game engine designed, planned and developed from scratch by me; for learning purposes and to obtain a deep insight into GPU programming and processing.\nThe Engine was developed with a node-system in mind, in which every game object is its own node and can become part of the scene tree to combine them and provide a wide variety of possible, expectable behavior with as little refactorization or redundant classes as possible.\nThe engine can run on Windows, Linux, MacOS, Android and iOS with support for Vulkan, DirectX, Metal and OpenGL graphical backends.",
      "esp": "Un motor de juegos experimental diseñado, planificado y desarrollado desde 0 por mi; por propósitos de aprendizaje y para obtener una vista profunda en el mundo de desarrollo y procesamiento de GPU.\nEl motor fue diseñado con un sistema de nodos en mente, en donde todos los objetos del juego son nodos que pueden formar parte del arbol de escena para combinarse y proveer una gran variedad de comportamientos pronosticables con la menor cantidad posible de refactorizaciones o clases redundantes como sea posible.\nEl motor puede correr en Windows, Linux, MacOS, Android e iOS con soporte para Vulkan, DirectX, Metal y OpenGL"
    },
    "AttachedMedia": null
  },
  {
    "Enabled": true,
    "Secondary": true,
	"LocalizedTag": {
		"eng": "Personal Project",
		"esp": "Proyecto Personal"
	},
    "Alt": "ToDoListBot",
    "LocalizedNames": {
      "eng": "Telegram ToDo List bot",
      "esp": "Bot de QueHaceres de Telegram"
    },
    "LocalizedDescriptions": {
      "eng": "A bot developed in C# to facilitate the planning of personal and group activities, with support for various lists, each one with their own tasks, status and descriptions. The bot can be used both in groups and through its own DM chat",
      "esp": "Un bot desarrollado en C# para facilitar la planificación personal y grupal de tareas, con soporte para varias listas, cada una con sus propias tareas, estados y descripción. El bot puede ser utilizado en grupos o a través del chat personal con el bot."
    },
    "AttachedMedia": null
  },
  {
    "Enabled": true,
    "Secondary": false,
	"LocalizedTag": {
		"eng": "Ordered Through Fiverr",
		"esp": "Ordenado a través de Fiverr"
	},
    "Alt": "Facial Recognition",
    "LocalizedNames": {
      "eng": "AI OpenCV Facial Recognition System",
      "esp": "Sistema de Reconocimiento Facial con OpenCV e IA"
    },
    "LocalizedDescriptions": {
      "esp": "Un sistema de reconocimiento facial hecho para validar y verificar fotos de perfil para detectar que la cara esté posicionada correctamente, incluyendo ojos, boca, brillo y calidad; y además, eliminar el trasfondo alrededor del sujeto.\nDesarrollado desde 0 por mí utilizando herramientas de IA junto con OpenCV. El API es capaz de recibir imagenes singulares o un stream de imagenes a través de un WebSocket para continúamente detectar que la cara esté correctamente posicionada.",
      "eng": "A facial recognition system designed to validate and verify profile pictures and detect that the subject's face is correctly positioned, including eyes, mouth, brightness and quality; and remove the background of the image around the subject.\nDeveloped by me from scratch utilizing AI tools and OpenCV. The API is capable of receiving singular images or a stream of images through a WebSocket to continually detect that the subject's face is correctly positioned."
    },
    "AttachedMedia": null
  },
  {
    "Enabled": true,
    "Secondary": true,
	"LocalizedTag": {
		"eng": "Ordered Through Fiverr",
		"esp": "Ordenado a través de Fiverr"
	},
    "Alt": "Ari Bot",
    "LocalizedNames": {
      "eng": "AriBot",
      "esp": "AriBot"
    },
    "LocalizedDescriptions": {
      "esp": "Un simple Bot de Discord que, cuando escribes 'Ari' en el chat, envía una imágen de Ariana Grande aleatoria con su descripción!",
      "eng": "A simple Discord bot that sends a random picture of Ariana Grande with a related description!."
    },
    "AttachedMedia": null
  },
  {
    "Enabled": true,
    "Secondary": true,
	"LocalizedTag": {
		"eng": "Ordered Through Fiverr",
		"esp": "Ordenado a través de Fiverr"
	},
    "Alt": "LogiTech GHUB",
    "LocalizedNames": {
      "eng": "LogiTech GHUB Utilities",
      "esp": "Utilidades con LogiTech GHUB"
    },
    "LocalizedDescriptions": {
      "esp": "Una pequeña colección de scripts para simplificar tareas repetitivas a través del uso de LogiTech GHUB con Lua",
      "eng": "A small collection of scripts to simplify repetitive tasks through the use of LogiTech GHUB and Lua"
    },
    "AttachedMedia": null
  },
  {
    "Enabled": true,
    "Secondary": true,
	"LocalizedTag": {
		"eng": "Ordered Through Fiverr",
		"esp": "Ordenado a través de Fiverr"
	},
    "Alt": "Bot Notification Network",
    "LocalizedNames": {
      "eng": "Bot Notification Network",
      "esp": "Red de notificaciones de Bots"
    },
    "LocalizedDescriptions": {
      "esp": "Un simple bot multiplataforma que recibe noticias y actualizaciones y las envia a Discord, Telegram y WhatsApp. Además, un administrador puede pedirle al bot que manualmente reenvie un mensaje directo desde cualquier plataforma, hacia cualquier plataforma.",
      "eng": "A simple multi-platform bot that receives news and updates to send them to Discord, Telegram and WhatsApp. Additionally, an admin can send a direct message to the bot from any platform and have it forward it to any or all of the other platforms."
    },
    "AttachedMedia": null
  },
  {
    "Enabled": true,
    "Secondary": true,
	"LocalizedTag": {
		"eng": "Ordered Through Fiverr",
		"esp": "Ordenado a través de Fiverr"
	},
    "Alt": "Code Tutorship",
    "LocalizedNames": {
      "esp": "Clases de Programación",
      "eng": "Programming Lessons"
    },
    "LocalizedDescriptions": {
      "eng": "A small show-case of reviews from my clients:\n\"Taught me what i asked for! Some new knowledge going in my brain, feels great!\" -learningdevil\n\"Excellent as always. Look forward to working with you again.\"-alphaai\n\"Clearly an intelligent and hard-working programmer. Very pleased with Diego! He has exceptional communication skills and seems to have a firm grasp of abstract concepts and also incredibly patient with my unorthodox LUA request. Highly recommended!\" -bowserpunch.\nVerifiable on [Fiverr](https://www.fiverr.com/diegog1014/teach-you-how-to-code-in-lua)",
      "esp": "Una pequeña muestra de las reviews de mis clientes:\n\"Taught me what i asked for! Some new knowledge going in my brain, feels great!\" -learningdevil\n\"Excellent as always. Look forward to working with you again.\"-alphaai\n\"Clearly an intelligent and hard-working programmer. Very pleased with Diego! He has exceptional communication skills and seems to have a firm grasp of abstract concepts and also incredibly patient with my unorthodox LUA request. Highly recommended!\" -bowserpunch.\nVerificable en [Fiverr](https://www.fiverr.com/diegog1014/teach-you-how-to-code-in-lua)"
    },
    "AttachedMedia": null
  },
  {
    "Enabled": true,
    "Secondary": false,
  	"LocalizedTag": {
  		"eng": "Asignación en WarlockCode",
  		"esp": "Asignación en WarlockCode"
  	},
    "Alt": "WarlockCode-Suite",
    "LocalizedNames": {
      "eng": "Software Suite for automatic control of business invoices",
      "esp": "Suite de Software para control automático de facturas de negocio"
    },
    "LocalizedDescriptions": {
      "eng": "A suite of applications, integrations and tools that work in symphony with the purpose of downloading and examining legal tax documents on inbound and outbound invoices among other documents, and organize them in a simple and managable manner.\nWithout exposing any classified information, the suite is based on 4 basic components:\n- Document Download: The documents are downloaded from official sources to be read, parsed, and their original forms stored. The parsed data is stored in a database.\n- Integrations with Existing Systems: The documents that are already stored in existing software are read and parsed as well, and compared with existing information. They are also then stored in the database, marking their source.\n- Analysis: The stored documents are then analyzed to extract useful information such as Key Performance Indicators.\n- Visualization: A progressive web application is developed with the purpose of demonstrating the performed analysis, and the complete searchable list of scanned documents.",
      "esp": "Una suite de aplicaciones, integraciones y herramientas que trabajan en sínfonia, con el propósito de descargar documentos legales de impuestos sobre facturas entrantes y salientes, además de otros documentos jurídicos y organizarlos de manera sencilla y manejable.\nSin dar información clasificada, la suite se basa en 4 componentes básicos:\n- Descarga de documentos legales: Los documentos se descargan de fuentes oficiales, se leen, parsean, y se almacena su forma original. Los datos se almacenan en una base de datos.\n- Integración con sistemas existentes: Se leen los documentos almacenados en aquellos sistemas que ya existían en la empresa previo a éste, y se almacenan en la base de datos, denotando su proveniencia.\n- Análisis: Se analizan los documentos para extraer información útil como Indicadores de Rendimiento Clave\n- Visualización en página web: Una página web desarrollada con el propósito de mostrar los análisis hechos, y la lista completa de documentos escaneados."
    },
    "AttachedMedia": null
  }
]
