[
  {
    "Enabled": true,
    "Alt": "Critical Conditions Controller for an Aquaponics System",
    "LocalizedNames": {
      "eng": "Critical Conditions Controller for an Aquaponics System",
      "esp": "Controlador de Condiciones Críticas para un Sistema Acuapónico"
    },
    "LocalizedDescriptions": {
      "eng": "A feature complete system designed from the ground up to manage, control and observe a full Aquaponics loop, including live fish observation, sensor-based comprehensive data reading and remote control and observation.\nFeaturing several microcontrollers from Arduino, to ESP32 and Raspberry Pis, a device -\u003E local server -\u003E global server architecture, and a beautiful UI front-end for displaying charts, information summaries, notifications and alerts; and manage permissions and granular user acceses.",
      "esp": "Un sistema repleto de features diseñado desde 0 para manejar, contorlar y observar un búcle acuapónico completo, incluyendo observación en vivo de los peces, lectura de parámetros comprensivos basado en sensores y control y observación remota.\nJunto con varios microcontroladores incluyendo Arduinos, ESP32 y Raspberry Pis, y una arquitectura modelada a partir de dispositivo -\u003E servidor local -\u003E servidor global, y una interfaz gráfica hermosa para mostrar gráficos de datos, sumarios informativos, notificaciones y alertas; y manejar permisos y acceso granular de usuario."
    },
    "AttachedMedia": null
  },
  {
    "Enabled": true,
    "Alt": "MagicEngine",
    "LocalizedNames": {
      "eng": "Video Game Engine with highly customizable graphics system",
      "esp": "Motor de Video Juegos con sistema gráfico personalizable"
    },
    "LocalizedDescriptions": {
      "eng": "An experimental game engine designed, planned and developed from scratch by me; for learning purposes and to obtain a deep insight into GPU programming and processing.\nThe Engine was developed with a node-system in mind, in which every game object is its own node and can become part of the scene tree to combine them and provide a wide variety of possible, expectable behavior with as little refactorization or redundant classes as possible.\nThe engine can run on Windows, Linux, MacOS, Android and iOS with support for Vulkan, DirectX, Metal and OpenGL graphical backends.",
      "esp": "Un motor de juegos experimental diseñado, planificado y desarrollado desde 0 por mi; por propósitos de aprendizaje y para obtener una vista profunda en el mundo de desarrollo y procesamiento de GPU.\nEl motor fue diseñado con un sistema de nodos en mente, en donde todos los objetos del juego son nodos que pueden formar parte del arbol de escena para combinarse y proveer una gran variedad de comportamientos pronosticables con la menor cantidad posible de refactorizaciones o clases redundantes como sea posible.\nEl motor puede correr en Windows, Linux, MacOS, Android e iOS con soporte para Vulkan, DirectX, Metal y OpenGL"
    },
    "AttachedMedia": null
  },
  {
    "Enabled": true,
    "Alt": "ToDoListBot",
    "LocalizedNames": {
      "eng": "Telegram ToDo List bot",
      "esp": "Bot de QueHaceres de Telegram"
    },
    "LocalizedDescriptions": {
      "eng": "A bot developed in C# to facilitate the planning of personal and group activities, with support for various lists, each one with their own tasks, status and descriptions. The bot can be used both in groups and through its own DM chat",
      "esp": "Un bot desarrollado en C# para facilitar la planificación personal y grupal de tareas, con soporte para varias listas, cada una con sus propias tareas, estados y descripción. El bot puede ser utilizado en grupos o a través del chat personal con el bot."
    },
    "AttachedMedia": null
  },
  {
    "Enabled": true,
    "Alt": "Facial Recognition",
    "LocalizedNames": {
      "eng": "AI OpenCV Facial Recognition System",
      "esp": "Sistema de Reconocimiento Facial con OpenCV e IA"
    },
    "LocalizedDescriptions": {
      "esp": "Un sistema de reconocimiento facial hecho para validar y verificar fotos de perfil para detectar que la cara esté posicionada correctamente, incluyendo ojos, boca, brillo y calidad; y además, eliminar el trasfondo alrededor del sujeto.\nDesarrollado desde 0 por mí utilizando herramientas de IA junto con OpenCV. El API es capaz de recibir imagenes singulares o un stream de imagenes a través de un WebSocket para continúamente detectar que la cara esté correctamente posicionada.",
      "eng": "A facial recognition system designed to validate and verify profile pictures and detect that the subject's face is correctly positioned, including eyes, mouth, brightness and quality; and remove the background of the image around the subject.\nDeveloped by me from scratch utilizing AI tools and OpenCV. The API is capable of receiving singular images or a stream of images through a WebSocket to continually detect that the subject's face is correctly positioned."
    },
    "AttachedMedia": null
  }
]
